cats99/app/controllers/cats_controller.rb

  def create
    new_cat = Cat.create!(cat_params)
---
INSERT INTO "cats" ("name", "birth_date", "color", "sex", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    cat = Cat.find(params[:id])
    if persisted?
      cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "cats" SET "name" = $1, "birth_date" = $2, "description" = $3, "sex" = $4, "updated_at" = $5 WHERE "cats"."id" = $6  [["name", "tiger"], ["birth_date", "2018-10-09"], ["description", "new cat"], ["sex", "F"], ["updated_at", "2019-09-03 18:55:23.659468"], ["id", 3]]